Конфигурация/Documents/РаспределениеДоходаПайщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РаспределениеДоходаПайщикам</Name>
			<BasedOn>
				<xr:Item>Document.РаспределениеДоходаПайщикам</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияНалогов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОпределенияСпискаЛиц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходаКРаспределению</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПаев</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеДоходаПайщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыплатыНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыплатыОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаспределениеДохода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пайщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолучательДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПаев</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачислениеНДФЛ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолучательДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДФЛ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДФЛ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ИФНСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИФНСОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоКрупнейшимНалогоплательщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДолиПайщиковВИнвестиционномФонде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДолиПайщиковВИнвестиционномФонде</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Comment>Дата записи в миллисекундах, для контроля последовательности проведения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗачислениеПаев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/СтавкиНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка09</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка30</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ставка35</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыНачисленоУплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоСамостоятельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоПоАктуПроверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/РаспределениеДоходаПайщикам/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки(Основание)

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоДенежнымСредствам");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация", 					ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание",             	  	Основание);

	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки()

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки(Основание);
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.НачисленияНалогов.Записывать = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записать();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаДокумента", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаОснования", Основание.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЕстьРаспределениеДохода", ЭтотОбъект.РаспределениеДохода.Количество() <> 0);
	Запрос.УстановитьПараметр("Рубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА РаспределениеДоходаПайщикамРаспределениеДохода.ПолучательДохода = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик
		|		ИНАЧЕ РаспределениеДоходаПайщикамРаспределениеДохода.ПолучательДохода
		|	КОНЕЦ КАК Контрагент,
		|	СУММА(РаспределениеДоходаПайщикамРаспределениеДохода.СуммаДохода) КАК Сумма
		|ПОМЕСТИТЬ _ДолжныПолучиться
		|ИЗ
		|	Документ.РаспределениеДоходаПайщикам.РаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДохода
		|ГДЕ
		|	РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА РаспределениеДоходаПайщикамРаспределениеДохода.ПолучательДохода = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
		|			ТОГДА РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик
		|		ИНАЧЕ РаспределениеДоходаПайщикамРаспределениеДохода.ПолучательДохода
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Контрагент КАК Контрагент,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход КАК СуммаПриход,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход КАК СуммаРасход
		|ПОМЕСТИТЬ _НачисленоПоОснованию
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&ДатаОснования,
		|			&МоментДокумента,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Основание = &Основание
		|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода КАК ПолучательДохода
		|ИЗ
		|	Документ.РаспределениеДоходаПайщикам.НачислениеНДФЛ КАК РаспределениеДоходаПайщикамНачислениеНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_ДолжныПолучиться.Контрагент КАК Контрагент,
		|			_ДолжныПолучиться.Сумма КАК Сумма
		|		ИЗ
		|			_ДолжныПолучиться КАК _ДолжныПолучиться
		|		ГДЕ
		|			&ЕстьРаспределениеДохода
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			_НачисленоПоОснованию.Контрагент,
		|			_НачисленоПоОснованию.СуммаПриход
		|		ИЗ
		|			_НачисленоПоОснованию КАК _НачисленоПоОснованию
		|		ГДЕ
		|			НЕ &ЕстьРаспределениеДохода) КАК Доход
		|		ПО РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода = Доход.Контрагент
		|ГДЕ
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка = &Ссылка
		|	И Доход.Контрагент ЕСТЬ NULL
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружено начисление НДФЛ пайщику " + Выборка.ПолучательДохода + ", которому не был распределен доход!",Ссылка,,,Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &Основание = ЗНАЧЕНИЕ(Документ.РаспределениеДоходаПайщикам.ПустаяСсылка)
		|			ТОГДА &Ссылка
		|		ИНАЧЕ &Основание
		|	КОНЕЦ КАК Основание,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&ДатаДокумента КАК Период,
		|	&Организация КАК Организация,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Рубль КАК Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская) КАК ТипЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям) КАК ВидЗадолженности,
		|	ЕСТЬNULL(_ДолжныПолучиться.Контрагент, _НачисленоПоОснованию.Контрагент) КАК Контрагент,
		|	ЕСТЬNULL(_ДолжныПолучиться.Сумма, 0) - ЕСТЬNULL(_НачисленоПоОснованию.СуммаПриход, 0) КАК Сумма,
		|	ЛОЖЬ КАК Аванс
		|ИЗ
		|	_ДолжныПолучиться КАК _ДолжныПолучиться
		|		ПОЛНОЕ СОЕДИНЕНИЕ _НачисленоПоОснованию КАК _НачисленоПоОснованию
		|		ПО _ДолжныПолучиться.Контрагент = _НачисленоПоОснованию.Контрагент
		|ГДЕ
		|	ЕСТЬNULL(_ДолжныПолучиться.Сумма, 0) - ЕСТЬNULL(_НачисленоПоОснованию.СуммаПриход, 0) <> 0
		|	И &ЕстьРаспределениеДохода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Основание = ЗНАЧЕНИЕ(Документ.РаспределениеДоходаПайщикам.ПустаяСсылка)
		|			ТОГДА &Ссылка
		|		ИНАЧЕ &Основание
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Дата,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Организация,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.СчетДоверительногоУправления,
		|	&Рубль,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская),
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям),
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.РаспределениеДоходаПайщикам.НачислениеНДФЛ КАК РаспределениеДоходаПайщикамНачислениеНДФЛ
		|ГДЕ
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка = &Ссылка
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Дата,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Организация,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.СчетДоверительногоУправления,
		|	&Рубль,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская),
		|	ВЫБОР
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ30)
		|	КОНЕЦ,
		|	ИФНСОрганизацийСрезПоследних.ИФНС,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ,
		|	ЛОЖЬ
		|ИЗ
		|	Документ.РаспределениеДоходаПайщикам.НачислениеНДФЛ КАК РаспределениеДоходаПайщикамНачислениеНДФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИФНСОрганизаций.СрезПоследних(
		|				&ДатаДокумента,
		|				Организация = &Организация
		|					И НЕ ПоКрупнейшимНалогоплательщикам) КАК ИФНСОрганизацийСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка = &Ссылка
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.ЗадолженностиПоДенежнымСредствам.Загрузить(РезультатЗапроса.Выгрузить());
	
	//движения НачисленияНалогов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Организация КАК Организация,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
		|		КОГДА РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ30)
		|	КОНЕЦ КАК ВидЗадолженности,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка КАК Основание,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода КАК Налогоплательщик,
		|	СУММА(РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаДохода) КАК БазаНалога,
		|	СУММА(РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ) КАК Сумма,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.РаспределениеДоходаПайщикам.НачислениеНДФЛ КАК РаспределениеДоходаПайщикамНачислениеНДФЛ
		|ГДЕ
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.СуммаНДФЛ <> 0
		|	И РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.ПолучательДохода,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.СтавкаНДФЛ,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Организация,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.СчетДоверительногоУправления,
		|	РаспределениеДоходаПайщикамНачислениеНДФЛ.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.НачисленияНалогов.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Движения.Записать();
	
	РегистрыНакопления.НачисленияНалогов.ПроверитьУдержаниеНалогаПоДоходу(ЭтотОбъект.Ссылка, Отказ);
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	//Доход
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
	
		//Первичное начисление по пайщикам
		Для Каждого СтрокаДохода из ЭтотОбъект.РаспределениеДохода Цикл 
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтрокаДохода.СуммаДохода, "Начислен доход пайщику");
			
			Проводка.СчетДт = ПланыСчетов.Основной.РаспределениеДоходаМеждуПайщиками;//ПрочееЦелевоеФинансированиеИПоступления;
			Проводка.СубконтоДт.Контрагенты = ?(ЗначениеЗаполнено(СтрокаДохода.ПолучательДохода), СтрокаДохода.ПолучательДохода, СтрокаДохода.Пайщик);
			
			Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
			Проводка.СубконтоКт.Контрагенты = ?(ЗначениеЗаполнено(СтрокаДохода.ПолучательДохода), СтрокаДохода.ПолучательДохода, СтрокаДохода.Пайщик);

		КонецЦикла;
		
	Иначе
		//ищем сторно дохода по номинальному держателю. Список лиц раскрывается один раз
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствам.Контрагент КАК Контрагент
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
			|ГДЕ
			|	ЗадолженностиПоДенежнымСредствам.Регистратор = &Регистратор
			|	И ЗадолженностиПоДенежнымСредствам.Сумма < 0
			|	И ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасчетыСПайщикамиПоВыплатеДоходаПоИнвестиционнымПаям)
			|	И ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)";
		
		Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			//раскрытие списка лиц
			Для Каждого СтрокаДохода из ЭтотОбъект.РаспределениеДохода Цикл 
				
				Если СтрокаДохода.Пайщик = СтрокаДохода.ПолучательДохода Тогда
					Продолжить;
				КонецЕсли;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтрокаДохода.СуммаДохода, "Раскрыт получатель дохода");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
				Проводка.СубконтоДт.Контрагенты = СтрокаДохода.Пайщик;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
				Проводка.СубконтоКт.Контрагенты = СтрокаДохода.ПолучательДохода;

			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Для Каждого СтрокаНалога Из ЭтотОбъект.НачислениеНДФЛ Цикл
				
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтрокаНалога.СуммаНДФЛ, "Начислен НДФЛ");
		
		Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
		Проводка.СубконтоДт.Контрагенты = СтрокаНалога.ПолучательДохода;
		
		Проводка.СчетКт = ПланыСчетов.Основной.НДФЛ;
		Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;

	КонецЦикла;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РаспределениеДоходаПайщикам") Тогда
		
		ЭтотОбъект.Основание = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Основание),ДанныеЗаполнения.Основание, ДанныеЗаполнения.Ссылка);
		ЭтотОбъект.ПаевойИнвестиционныйФонд = ДанныеЗаполнения.ПаевойИнвестиционныйФонд;
		ЭтотОбъект.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ПаевойИнвестиционныйФонд);
		ЭтотОбъект.ДатаОпределенияСпискаЛиц = 0;
		ЭтотОбъект.СуммаДоходаКРаспределению = 0;
		ЭтотОбъект.КоличествоПаев = 0;
		
		ЗаполнитьРаспределениеДохода();
		ЗаполнитьНДФЛ(Ложь);
		
	Иначе
		СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(ПаевойИнвестиционныйФонд);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
		ДатаОпределенияСпискаЛиц = 0;
		СуммаДоходаКРаспределению = 0;
		КоличествоПаев = 0;
	КонецЕсли;
	
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЭтотОбъект.РаспределениеДохода.Количество()>0 Тогда
			
			//проверим  сумму паев  и сумму дохода
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ТЧРаспределениеДохода.Пайщик КАК Пайщик,
				|	ТЧРаспределениеДохода.ПолучательДохода КАК ПолучательДохода,
				|	ТЧРаспределениеДохода.КоличествоПаев КАК КоличествоПаев,
				|	ТЧРаспределениеДохода.СуммаДохода КАК СуммаДохода
				|ПОМЕСТИТЬ _РаспределениеДоходаПайщикамРаспределениеДохода
				|ИЗ
				|	&ТЧРаспределениеДохода КАК ТЧРаспределениеДохода";
			
			Запрос.УстановитьПараметр("ТЧРаспределениеДохода", ЭтотОбъект.РаспределениеДохода.Выгрузить());
			Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
			Запрос.УстановитьПараметр("КоличествоПаев", ЭтотОбъект.КоличествоПаев);
			Запрос.УстановитьПараметр("СуммаДоходаКРаспределению", ЭтотОбъект.СуммаДоходаКРаспределению);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
			Запрос.Выполнить();
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	СУММА(РаспределениеДоходаПайщикамРаспределениеДохода.КоличествоПаев) КАК КоличествоПаев,
					|	СУММА(РаспределениеДоходаПайщикамРаспределениеДохода.СуммаДохода) КАК СуммаДохода,
					|	ВЫБОР
					|		КОГДА &Основание = ЗНАЧЕНИЕ(Документ.РаспределениеДоходаПайщикам.)
					|			ТОГДА &КоличествоПаев
					|		ИНАЧЕ РаспределениеДоходаПайщикам.КоличествоПаев
					|	КОНЕЦ КАК КоличествоПаевОснования,
					|	ВЫБОР
					|		КОГДА &Основание = ЗНАЧЕНИЕ(Документ.РаспределениеДоходаПайщикам.)
					|			ТОГДА &СуммаДоходаКРаспределению
					|		ИНАЧЕ РаспределениеДоходаПайщикам.СуммаДоходаКРаспределению
					|	КОНЕЦ КАК СуммаДоходаКРаспределениюОснования
					|ИЗ
					|	_РаспределениеДоходаПайщикамРаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДохода
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеДоходаПайщикам КАК РаспределениеДоходаПайщикам
					|		ПО (ИСТИНА)
					|ГДЕ
					|	РаспределениеДоходаПайщикам.Ссылка = &Основание
					|
					|СГРУППИРОВАТЬ ПО
					|	РаспределениеДоходаПайщикам.КоличествоПаев,
					|	РаспределениеДоходаПайщикам.СуммаДоходаКРаспределению
					|
					|ИМЕЮЩИЕ
					|	(СУММА(РаспределениеДоходаПайщикамРаспределениеДохода.КоличествоПаев) <> РаспределениеДоходаПайщикам.КоличествоПаев
					|		ИЛИ СУММА(РаспределениеДоходаПайщикамРаспределениеДохода.СуммаДохода) <> РаспределениеДоходаПайщикам.СуммаДоходаКРаспределению)";
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.КоличествоПаев <> ВыборкаДетальныеЗаписи.КоличествоПаевОснования Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество паев отличается в текущем документе (" 
							+ ВыборкаДетальныеЗаписи.КоличествоПаев + ") и в основании (" 
							+ ВыборкаДетальныеЗаписи.КоличествоПаевОснования + ")", Ссылка,,, Отказ);
					КонецЕсли;
					Если ВыборкаДетальныеЗаписи.СуммаДохода <> ВыборкаДетальныеЗаписи.СуммаДоходаКРаспределениюОснования Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма дохода отличается в текущем документе ("
							+ ВыборкаДетальныеЗаписи.СуммаДохода + ") и в основании ("
							+ ВыборкаДетальныеЗаписи.СуммаДоходаКРаспределениюОснования + ")", Ссылка,,, Отказ);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
				СуммаДоходаТЧ 		= ЭтотОбъект.РаспределениеДохода.Итог("СуммаДохода");
				КоличествоПаевТЧ 	= ЭтотОбъект.РаспределениеДохода.Итог("КоличествоПаев");
				
				Если ЭтотОбъект.КоличествоПаев <> КоличествоПаевТЧ Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество паев отличается в шапке (" 
						+ ЭтотОбъект.КоличествоПаев + ") и в табличной части (" + КоличествоПаевТЧ + ")", Ссылка,,, Отказ);
				КонецЕсли;
				Если ЭтотОбъект.СуммаДоходаКРаспределению <> СуммаДоходаТЧ Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма дохода отличается в шапке ("
						+ ЭтотОбъект.СуммаДоходаКРаспределению + ") и в табличной части (" + СуммаДоходаТЧ + ")", Ссылка,,, Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЕСТЬNULL(ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик, РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик) КАК Пайщик,
				|	ЕСТЬNULL(ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток, 0) КАК КоличествоПаевРегистр,
				|	ЕСТЬNULL(РаспределениеДоходаПайщикамРаспределениеДохода.КоличествоПаевДокумент, 0) КАК КоличествоПаевДокумент
				|ИЗ
				|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
				|			&ДатаОпределенияСпискаЛиц,
				|			ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд
				|				И Организация = &Организация) КАК ДолиПайщиковВИнвестиционномФондеОстатки
				|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик КАК Пайщик,
				|			СУММА(ЕСТЬNULL(РаспределениеДоходаПайщикамРаспределениеДохода.КоличествоПаев, 0)) КАК КоличествоПаевДокумент
				|		ИЗ
				|			_РаспределениеДоходаПайщикамРаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДохода
				|		
				|		СГРУППИРОВАТЬ ПО
				|			РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик) КАК РаспределениеДоходаПайщикамРаспределениеДохода
				|		ПО (РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик = ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик)
				|ГДЕ
				|	ЕСТЬNULL(ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток, 0) <> ЕСТЬNULL(РаспределениеДоходаПайщикамРаспределениеДохода.КоличествоПаевДокумент, 0)";
			
			Запрос.УстановитьПараметр("ДатаОпределенияСпискаЛиц", ?(ЗначениеЗаполнено(Основание), КонецДня(Основание.ДатаОпределенияСпискаЛиц), КонецДня(ЭтотОбъект.ДатаОпределенияСпискаЛиц)));
			Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
			Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ПаевойИнвестиционныйФонд);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество паев для пайщика "+ВыборкаДетальныеЗаписи.Пайщик+" отличается в текущем документе ("+ВыборкаДетальныеЗаписи.КоличествоПаевДокумент+") и на остатках паев ("+ВыборкаДетальныеЗаписи.КоличествоПаевРегистр+")",Ссылка,,, Отказ);
			КонецЦикла;
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РаспределениеДоходаПайщикамРаспределениеДоходаРаспределение.Пайщик КАК Пайщик,
				|	РаспределениеДоходаПайщикамРаспределениеДоходаРаспределение.ПолучательДохода КАК ПолучательДохода
				|ИЗ
				|	_РаспределениеДоходаПайщикамРаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДоходаРаспределение
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _РаспределениеДоходаПайщикамРаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДоходаНетПолучателя
				|		ПО (РаспределениеДоходаПайщикамРаспределениеДоходаРаспределение.Пайщик <> РаспределениеДоходаПайщикамРаспределениеДоходаРаспределение.ПолучательДохода)
				|			И (РаспределениеДоходаПайщикамРаспределениеДоходаРаспределение.ПолучательДохода <> ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) И (РаспределениеДоходаПайщикамРаспределениеДоходаНетПолучателя.ПолучательДохода = ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раскрытие списка лиц, имеющих право на получение дохода возможно только один раз! Не все получатели дохода указаны",Ссылка,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	                                                                                         
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТЧдляРЭМ

Функция ПолучитьСчетаУчетаПереоценкиИПроверитьКорректность()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУчетаАктивовСрезПоследних.СчетУчета КАК СчетУчета,
	|	НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки КАК СчетУчетаПереоценки,
	|	ВЫБОР
	|		КОГДА НастройкиУчетаАктивовСрезПоследних.СчетУчета = НастройкиУчетаАктивовСрезПоследних.СчетУчетаПереоценки
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Ошибка
	|ИЗ
	|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
	|			&ПериодОкончание,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет)
	|				И УчетныйАктив В (&АктивыКупон)) КАК НастройкиУчетаАктивовСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ошибка УБЫВ";
	
	АктивыКупон = Новый Массив;
	АктивыКупон.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон);
	АктивыКупон.Добавить(Справочники.УчетныеАктивы.ОблигацииГосударственныеНоминированныеВИностраннойВалютеКупон);
	АктивыКупон.Добавить(Справочники.УчетныеАктивы.ОблигацииКорпоративныеКупон);
	АктивыКупон.Добавить(Справочники.УчетныеАктивы.ЕврооблигацииКупон);  
	
	Запрос.УстановитьПараметр("АктивыКупон", АктивыКупон);

	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(ЭтотОбъект.ПериодВыплатыОкончание));
	
	СчетаУчета = Новый Массив;
	Аналитики = Новый Массив;

	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	Если РезультатЗапроса.Количество() = 0 Тогда 
		ВызватьИсключение "Не заданы настройки учета активов.";
	КонецЕсли;	
	
	Если РезультатЗапроса[0].Ошибка Тогда 
		ВызватьИсключение "Проверьте настройки учета купонов. 'Счет учета' и 'Счет учета переоценки' должны отличаться. ";
	КонецЕсли;
		
	Возврат РезультатЗапроса.ВыгрузитьКолонку("СчетУчетаПереоценки");
	
КонецФункции

Процедура РассчитатьСуммуВыплатыИЗаполнитьРаспределениеДохода() Экспорт
	
	ЭтотОбъект.РаспределениеДохода.Очистить();
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления); 
	Запрос.УстановитьПараметр("ПериодНачало", НачалоДня(ЭтотОбъект.ПериодВыплатыНачало));
	Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(ЭтотОбъект.ПериодВыплатыОкончание));  
	Запрос.УстановитьПараметр("ДатаОпределенияСпискаЛиц", КонецДня(ЭтотОбъект.ДатаОпределенияСпискаЛиц));
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("СчетаУчетаПереоценки", ПолучитьСчетаУчетаПереоценкиИПроверитьКорректность());
				
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Погашение
	|ПОМЕСТИТЬ _ПогашенияКупона
	|ИЗ
	|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
	|			&ПериодНачало,
	|			&ПериодОкончание,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона))) КАК ЗадолженностиПоДенежнымСредствамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(БухгалтерскийУчет.Сумма), 0) КАК Сумма
	|ПОМЕСТИТЬ _СуммаВыплаты
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет КАК БухгалтерскийУчет
	|ГДЕ
	|	БухгалтерскийУчет.Организация = &Организация
	|	И БухгалтерскийУчет.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И БухгалтерскийУчет.Регистратор В
	|			(ВЫБРАТЬ
	|				_ПогашенияКупона.Погашение КАК Погашение
	|			ИЗ
	|				_ПогашенияКупона КАК _ПогашенияКупона)
	|	И БухгалтерскийУчет.СчетКт В(&СчетаУчетаПереоценки)
	|	И БухгалтерскийУчет.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик КАК Пайщик,
	|	ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ДепозитарныеКомпании.Ссылка ЕСТЬ NULL
	|			ТОГДА ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПолучательДохода
	|ПОМЕСТИТЬ _ДолиПайщиков
	|ИЗ
	|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
	|			&ДатаОпределенияСпискаЛиц,
	|			Организация = &Организация
	|				И ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК ДолиПайщиковВИнвестиционномФондеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеКомпании КАК ДепозитарныеКомпании
	|		ПО ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик = ДепозитарныеКомпании.ЮрФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_СуммаВыплаты.Сумма КАК СуммаВыплаты,
	|	КоличествоПаев.КоличествоОстаток КАК КоличествоПаев
	|ПОМЕСТИТЬ _ДанныеДляРасчета
	|ИЗ
	|	_СуммаВыплаты КАК _СуммаВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(_ДолиПайщиков.КоличествоОстаток) КАК КоличествоОстаток
	|		ИЗ
	|			_ДолиПайщиков КАК _ДолиПайщиков) КАК КоличествоПаев
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДолиПайщиков.Пайщик КАК Пайщик,
	|	_ДолиПайщиков.ПолучательДохода КАК ПолучательДохода,
	|	_ДолиПайщиков.КоличествоОстаток КАК КоличествоПаев,
	|	ВЫБОР
	|		КОГДА _ДанныеДляРасчета.КоличествоПаев > 0
	|			ТОГДА ВЫРАЗИТЬ(_ДолиПайщиков.КоличествоОстаток * _ДанныеДляРасчета.СуммаВыплаты / _ДанныеДляРасчета.КоличествоПаев КАК ЧИСЛО(19, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДохода
	|ИЗ
	|	_ДолиПайщиков КАК _ДолиПайщиков
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеДляРасчета КАК _ДанныеДляРасчета
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоОстаток";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЭтотОбъект.РаспределениеДохода.Загрузить(РезультатЗапроса.Выгрузить());
	
	//Это "правильные суммы". 
	ДанныеДляРасчета = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ДанныеДляРасчета").ПолучитьДанные().Выбрать();
	Если ДанныеДляРасчета.Следующий() Тогда
		ЭтотОбъект.СуммаДоходаКРаспределению = ДанныеДляРасчета.СуммаВыплаты;
		ЭтотОбъект.КоличествоПаев = ДанныеДляРасчета.КоличествоПаев;
	КонецЕсли;
	
	//Погрешность. Копейку впихнем самому богатому.
	Погрешность = ЭтотОбъект.СуммаДоходаКРаспределению - ЭтотОбъект.РаспределениеДохода.Итог("СуммаДохода");
	// маловероятно, что погрешность по модулю больше одной копейки  
	// но сделаем по ТЗ.
	// теоретически в каждой строке погрешность может быть 1 копейка
	// тогда количество циклов будет равно количеству строк
	
	Если Погрешность <> 0 Тогда 
		ЭтотОбъект.РаспределениеДохода.Сортировать("КоличествоПаев Убыв");
		
		МодульПогрешности = МатематическиеФункции.МодульЧисла(Погрешность);
		ЗнакПогрешности = МатематическиеФункции.ЗнакЧисла(Погрешность);
		Для Каждого СтрокаДохода из ЭтотОбъект.РаспределениеДохода Цикл
			
			СтрокаДохода.СуммаДохода = СтрокаДохода.СуммаДохода + (0.01 * ЗнакПогрешности);
			МодульПогрешности = МодульПогрешности - 0.01;
			Если МодульПогрешности = 0 Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьРаспределениеДохода() Экспорт
	
	Если ЭтотОбъект.Организация <> ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РПИ") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ПаевойИнвестиционныйФонд) 
		И НЕ ЗначениеЗаполнено(ЭтотОбъект.Основание) 
		И ЗначениеЗаполнено(ЭтотОбъект.ДатаОпределенияСпискаЛиц) Тогда
		
		ЭтотОбъект.РаспределениеДохода.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик КАК Пайщик,
			|	СУММА(ДолиПайщиковВИнвестиционномФондеОстатки.КоличествоОстаток) КАК КоличествоОстаток,
			|	НЕ ДепозитарныеКомпании.Ссылка ЕСТЬ NULL КАК ЭтоДепозитарий
			|ИЗ
			|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
			|			&ДатаОпределенияСпискаЛиц,
			|			Организация = &Организация
			|				И ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК ДолиПайщиковВИнвестиционномФондеОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеКомпании КАК ДепозитарныеКомпании
			|		ПО ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик = ДепозитарныеКомпании.ЮрФизЛицо
			|
			|СГРУППИРОВАТЬ ПО
			|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик,
			|	НЕ ДепозитарныеКомпании.Ссылка ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ДатаОпределенияСпискаЛиц", КонецДня(ЭтотОбъект.ДатаОпределенияСпискаЛиц));
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ПаевойИнвестиционныйФонд);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СуммаДоходаРаспределить = ЭтотОбъект.СуммаДоходаКРаспределению;
		ПаевРаспределить = ЭтотОбъект.КоличествоПаев;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.РаспределениеДохода.Добавить();
			НоваяСтрока.Пайщик = ВыборкаДетальныеЗаписи.Пайщик;
			Если НЕ ВыборкаДетальныеЗаписи.ЭтоДепозитарий Тогда
				НоваяСтрока.ПолучательДохода = ВыборкаДетальныеЗаписи.Пайщик;
			КонецЕсли;
			НоваяСтрока.КоличествоПаев = ВыборкаДетальныеЗаписи.КоличествоОстаток;
			НоваяСтрока.СуммаДохода = СуммаДоходаРаспределить * НоваяСтрока.КоличествоПаев / ПаевРаспределить;
			
			СуммаДоходаРаспределить = СуммаДоходаРаспределить - НоваяСтрока.СуммаДохода;
			ПаевРаспределить = ПаевРаспределить - НоваяСтрока.КоличествоПаев;
		КонецЦикла;
			
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Основание) Тогда
		
		Запрос = Новый Запрос;
		
		//Получим данные предыдущего начисления в цепочке
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка КАК Ссылка,
			|	МИНИМУМ(РаспределениеДоходаПайщикамРаспределениеДохода.ПолучательДохода <> ЗНАЧЕНИЕ(Справочник.ЮрФизлица.ПустаяСсылка)) КАК ВсеПолучателиДоходаЗаполнены
			|ПОМЕСТИТЬ _ПоследнийДокументВЦепочке
			|ИЗ
			|	Документ.РаспределениеДоходаПайщикам.РаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДохода
			|ГДЕ
			|	РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка.Проведен
			|	И РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка.Организация = &Организация
			|	И РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка.ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд
			|	И (РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка.Основание = &Основание
			|			ИЛИ РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка = &Основание)
			|	И (РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка.Дата < &ДатаТекущегоДокумента
			|			ИЛИ &ДатаТекущегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
			|
			|СГРУППИРОВАТЬ ПО
			|	РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка.МоментВремени УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик КАК Пайщик,
			|	РаспределениеДоходаПайщикамРаспределениеДохода.ПолучательДохода КАК ПолучательДохода,
			|	РаспределениеДоходаПайщикамРаспределениеДохода.КоличествоПаев КАК КоличествоПаев,
			|	РаспределениеДоходаПайщикамРаспределениеДохода.СуммаДохода КАК СуммаДохода,
			|	_ПоследнийДокументВЦепочке.ВсеПолучателиДоходаЗаполнены КАК ВсеПолучателиДоходаЗаполнены
			|ИЗ
			|	_ПоследнийДокументВЦепочке КАК _ПоследнийДокументВЦепочке
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеДоходаПайщикам.РаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДохода
			|		ПО _ПоследнийДокументВЦепочке.Ссылка = РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Основание", Основание);
		Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ПаевойИнвестиционныйФонд);
		Запрос.УстановитьПараметр("ДатаТекущегоДокумента", ЭтотОбъект.Дата);
		
		РаспределениеДоходаИзПоследнегоДокумента = Запрос.Выполнить().Выгрузить();
		
		
		Если ЭтотОбъект.РаспределениеДохода.Количество()= 0 Тогда
			
			Если РаспределениеДоходаИзПоследнегоДокумента.Количество() > 0 
				И РаспределениеДоходаИзПоследнегоДокумента[0].ВсеПолучателиДоходаЗаполнены Тогда
				//если заполнены все получатели дохода - скопируем табличную часть 
				
				ЭтотОбъект.РаспределениеДохода.Загрузить(РаспределениеДоходаИзПоследнегоДокумента);
				Возврат;
					
			Иначе
				//если получатели дохода не заполнены - возьмем их из документа распределения прошлого месяца/квартала (предполагаем, что они не изменились)
			 	Запрос.Текст = 
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	РаспределениеДоходаПайщикамРаспределениеДохода.Пайщик КАК Пайщик,
					|	РаспределениеДоходаПайщикамРаспределениеДохода.ПолучательДохода КАК ПолучательДохода,
					|	РаспределениеДоходаПайщикамРаспределениеДохода.КоличествоПаев КАК КоличествоПаев
					|ИЗ
					|	Документ.РаспределениеДоходаПайщикам.РаспределениеДохода КАК РаспределениеДоходаПайщикамРаспределениеДохода
					|ГДЕ
					|	РаспределениеДоходаПайщикамРаспределениеДохода.Ссылка В
					|			(ВЫБРАТЬ ПЕРВЫЕ 1
					|				РаспределениеДоходаПайщикам.Ссылка КАК Ссылка
					|			ИЗ
					|				Документ.РаспределениеДоходаПайщикам КАК РаспределениеДоходаПайщикам
					|			ГДЕ
					|				РаспределениеДоходаПайщикам.ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд
					|				И РаспределениеДоходаПайщикам.Организация = &Организация
					|				И РаспределениеДоходаПайщикам.Основание <> ЗНАЧЕНИЕ(Документ.РаспределениеДоходаПайщикам.ПустаяСсылка)
					|				И РаспределениеДоходаПайщикам.Дата < &Дата
					|			УПОРЯДОЧИТЬ ПО
					|				РаспределениеДоходаПайщикам.МоментВремени УБЫВ)";
				
				Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Основание.Дата);
				Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
				Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ПаевойИнвестиционныйФонд);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ЭтотОбъект.РаспределениеДохода.Загрузить(РезультатЗапроса.Выгрузить());
				
			КонецЕсли;
		КонецЕсли;

		Если РаспределениеДоходаИзПоследнегоДокумента.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные предыдущего начисления по выбранному основанию!");
			Возврат;
		КонецЕсли;
		
		//распределим доход пропорционально количеству паев. Суммы дохода пайщика - из основания
		Для Каждого СтрокаДокумента из ЭтотОбъект.РаспределениеДохода Цикл
			Если СтрокаДокумента.Пайщик = СтрокаДокумента.ПолучательДохода Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаДокумента.ПолучательДохода) ТОгда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке "+СтрокаДокумента.НомерСтроки+" не заполнен получатель дохода");						
				Иначе
					СтрокиСПолучателем = РаспределениеДоходаИзПоследнегоДокумента.НайтиСтроки(Новый Структура("Пайщик,ПолучательДохода",СтрокаДокумента.Пайщик,СтрокаДокумента.ПолучательДохода));
					Если СтрокиСПолучателем.Количество() > 1 Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В исходном документе получатель дохода и пайщик "+СтрокаДокумента.ПолучательДохода+" обнаружен более одного раза");
					КонецЕсли;
					Если СтрокиСПолучателем[0].КоличествоПаев <> СтрокаДокумента.КоличествоПаев Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество паев, начисленного пайщику и получателю дохода " 
							+ СтрокаДокумента.ПолучательДохода + " отличается. Было " + СтрокиСПолучателем[0].КоличествоПаев 
							+ ", стало " + СтрокаДокумента.КоличествоПаев);
					КонецЕсли;
					Если СтрокиСПолучателем[0].СуммаДохода <> 0 И СтрокаДокумента.СуммаДохода = 0 Тогда
						СтрокаДокумента.СуммаДохода = СтрокиСПолучателем[0].СуммаДохода;
					ИначеЕсли СтрокиСПолучателем[0].СуммаДохода <> СтрокаДокумента.СуммаДохода Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма дохода и/или количество паев, начисленного пайщику и получателю дохода "+СтрокаДокумента.ПолучательДохода+" отличается. Было " + СтрокиСПолучателем[0].СуммаДохода + " (количество "+СтрокиСПолучателем[0].КоличествоПаев+"), стало " + СтрокаДокумента.СуммаДохода+" (количество "+СтрокаДокумента.КоличествоПаев+")");
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДокумента.ПолучательДохода) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке "+СтрокаДокумента.НомерСтроки+" не заполнен получатель дохода. Пайщик "+СтрокаДокумента.Пайщик);
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДокумента.Пайщик) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке "+СтрокаДокумента.НомерСтроки+" не заполнен пайщик");
			Иначе
				СтрокиСПайщиком = РаспределениеДоходаИзПоследнегоДокумента.НайтиСтроки(Новый Структура("Пайщик,ПолучательДохода",СтрокаДокумента.Пайщик,Справочники.ЮрФизЛица.ПустаяСсылка()));
				Если СтрокиСПолучателем.Количество()>1 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В исходном документе обнаружено несколько строк с пайщиком "+СтрокаДокумента.Пайщик);
				КонецЕсли;
				Для Каждого СтрокаСПайщиком из СтрокиСПайщиком Цикл
					Если СтрокаСПайщиком.КоличествоПаев = 0 Тогда
						Продолжить;
					КонецЕсли;
					Если СтрокаСПайщиком.КоличествоПаев = СтрокаДокумента.КоличествоПаев Тогда
						СтрокаДокумента.СуммаДохода = СтрокаСПайщиком.СуммаДохода;
					Иначе
						СтрокаДокумента.СуммаДохода = СтрокаСПайщиком.СуммаДохода * СтрокаДокумента.КоличествоПаев / СтрокаСПайщиком.КоличествоПаев;
					КонецЕсли;
					СтрокаСПайщиком.КоличествоПаев = СтрокаСПайщиком.КоличествоПаев - СтрокаДокумента.КоличествоПаев;
					СтрокаСПайщиком.СуммаДохода = СтрокаСПайщиком.СуммаДохода - СтрокаДокумента.СуммаДохода;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНДФЛ(Отказ, ТаблицаДохода = Неопределено) Экспорт
	
	Если ЭтотОбъект.НачислениеНДФЛ.Количество() = 0 ИЛИ ТаблицаДохода <> Неопределено Тогда
		
		//получим суммы дохода: из табличной части, если было начисление дохода или по приходу дохода ранее
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаДохода.ПолучательДохода КАК ПолучательДохода,
			|	ТаблицаДохода.СуммаДохода КАК СуммаДохода,
			|	ТаблицаДохода.СтавкаНДФЛ КАК СтавкаНДФЛ
			|ПОМЕСТИТЬ _ТаблицаДохода
			|ИЗ
			|	&ТаблицаДохода КАК ТаблицаДохода
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ИсходнаяТаблицаПредварительно.ПолучательДохода КАК ПолучательДохода,
			|	ВЫБОР
			|		КОГДА СУММА(_ИсходнаяТаблицаПредварительно.СуммаДохода) < 0
			|			ТОГДА 0
			|		ИНАЧЕ СУММА(_ИсходнаяТаблицаПредварительно.СуммаДохода)
			|	КОНЕЦ КАК СуммаДохода,
			|	_ИсходнаяТаблицаПредварительно.СтавкаНДФЛ КАК СтавкаНДФЛ
			|ПОМЕСТИТЬ _ИсходнаяТаблица
			|ИЗ
			|	(ВЫБРАТЬ
			|		_ТаблицаДохода.ПолучательДохода КАК ПолучательДохода,
			|		_ТаблицаДохода.СуммаДохода КАК СуммаДохода,
			|		_ТаблицаДохода.СтавкаНДФЛ КАК СтавкаНДФЛ
			|	ИЗ
			|		_ТаблицаДохода КАК _ТаблицаДохода
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		НачисленияНалоговОбороты.Налогоплательщик,
			|		-ЕСТЬNULL(НачисленияНалоговОбороты.БазаНалогаОборот, 0),
			|		ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.ПустаяСсылка)
			|	ИЗ
			|		РегистрНакопления.НачисленияНалогов.Обороты(
			|				&НачалоОборотов,
			|				&МоментДокумента,
			|				,
			|				Организация = &Организация
			|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|					И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))
			|					И (Основание = &Основание
			|						ИЛИ ВЫРАЗИТЬ(Основание КАК Документ.РаспределениеДоходаПайщикам).Основание = &Основание)
			|					И Основание <> &Ссылка) КАК НачисленияНалоговОбороты
			|	ГДЕ
			|		&УчестьНалогообложенныйДоходПоОснованию) КАК _ИсходнаяТаблицаПредварительно
			|
			|СГРУППИРОВАТЬ ПО
			|	_ИсходнаяТаблицаПредварительно.ПолучательДохода,
			|	_ИсходнаяТаблицаПредварительно.СтавкаНДФЛ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ИсходнаяТаблица.ПолучательДохода КАК ПолучательДохода,
			|	СУММА(_ИсходнаяТаблица.СуммаДохода) КАК СуммаДохода,
			|	ВЫБОР
			|		КОГДА _ИсходнаяТаблица.СтавкаНДФЛ <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.ПустаяСсылка)
			|			ТОГДА _ИсходнаяТаблица.СтавкаНДФЛ
			|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.МаксимальнаяСтавкаНДФЛ, 0) <= 13
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
			|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.МаксимальнаяСтавкаНДФЛ, 0) = 15
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
			|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.МаксимальнаяСтавкаНДФЛ, 0) = 30
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
			|	КОНЕЦ КАК СтавкаНДФЛ
			|ПОМЕСТИТЬ _ДоходыТекущегоРаспределения
			|ИЗ
			|	_ИсходнаяТаблица КАК _ИсходнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			НачисленияНалоговОбороты.Налогоплательщик КАК Налогоплательщик,
			|			МАКСИМУМ(ВЫБОР
			|					КОГДА НачисленияНалоговОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
			|						ТОГДА 13
			|					КОГДА НачисленияНалоговОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
			|						ТОГДА 15
			|					КОГДА НачисленияНалоговОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ30)
			|						ТОГДА 30
			|				КОНЕЦ) КАК МаксимальнаяСтавкаНДФЛ
			|		ИЗ
			|			РегистрНакопления.НачисленияНалогов.Обороты(
			|					НАЧАЛОПЕРИОДА(&Дата, ГОД),
			|					&МоментДокумента,
			|					,
			|					Организация = &Организация
			|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|						И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))
			|						И ГОД(ВЫРАЗИТЬ(Основание КАК Документ.РаспределениеДоходаПайщикам).Дата) = ГОД(&Дата)
			|						И Налогоплательщик В
			|							(ВЫБРАТЬ
			|								_ИсходнаяТаблица.ПолучательДохода
			|							ИЗ
			|								_ИсходнаяТаблица КАК _ИсходнаяТаблица)) КАК НачисленияНалоговОбороты
			|		
			|		СГРУППИРОВАТЬ ПО
			|			НачисленияНалоговОбороты.Налогоплательщик) КАК ВложенныйЗапрос
			|		ПО _ИсходнаяТаблица.ПолучательДохода = ВложенныйЗапрос.Налогоплательщик
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
			|		ПО _ИсходнаяТаблица.ПолучательДохода = ЮрФизЛица.Ссылка
			|			И (ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо))
			|
			|СГРУППИРОВАТЬ ПО
			|	_ИсходнаяТаблица.ПолучательДохода,
			|	_ИсходнаяТаблица.СтавкаНДФЛ,
			|	ВложенныйЗапрос.МаксимальнаяСтавкаНДФЛ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачисленияНалоговОбороты.Налогоплательщик КАК ПолучательДохода,
			|	ВЫБОР
			|		КОГДА НачисленияНалоговОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка13)
			|		КОГДА НачисленияНалоговОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ15)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка15)
			|		КОГДА НачисленияНалоговОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ30)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДФЛ.Ставка30)
			|	КОНЕЦ КАК СтавкаНДФЛ,
			|	НачисленияНалоговОбороты.БазаНалогаОборот КАК СуммаДохода,
			|	НачисленияНалоговОбороты.СуммаОборот КАК СуммаНДФЛ
			|ПОМЕСТИТЬ _ДоходыЗаГод
			|ИЗ
			|	РегистрНакопления.НачисленияНалогов.Обороты(
			|			НАЧАЛОПЕРИОДА(&Дата, ГОД),
			|			&МоментДокумента,
			|			,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДФЛ))
			|				И ГОД(ВЫРАЗИТЬ(Основание КАК Документ.РаспределениеДоходаПайщикам).Дата) = ГОД(&Дата)
			|				И Налогоплательщик В
			|					(ВЫБРАТЬ
			|						_ИсходнаяТаблица.ПолучательДохода
			|					ИЗ
			|						_ИсходнаяТаблица КАК _ИсходнаяТаблица)) КАК НачисленияНалоговОбороты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДоходыТекущегоРаспределения.ПолучательДохода КАК ПолучательДохода,
			|	_ДоходыТекущегоРаспределения.СуммаДохода КАК СуммаДохода,
			|	_ДоходыТекущегоРаспределения.СтавкаНДФЛ КАК СтавкаНДФЛ,
			|	ЕСТЬNULL(_ДоходыЗаГод.СуммаДохода, 0) КАК СуммаДоходаЗаГод,
			|	ЕСТЬNULL(_ДоходыЗаГод.СуммаНДФЛ, 0) КАК СуммаНДФЛЗаГод
			|ИЗ
			|	_ДоходыТекущегоРаспределения КАК _ДоходыТекущегоРаспределения
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДоходыЗаГод КАК _ДоходыЗаГод
			|		ПО _ДоходыТекущегоРаспределения.ПолучательДохода = _ДоходыЗаГод.ПолучательДохода
			|			И _ДоходыТекущегоРаспределения.СтавкаНДФЛ = _ДоходыЗаГод.СтавкаНДФЛ";
		
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		ДатаРасчета = ?(ЗначениеЗаполнено(ЭтотОбъект.Дата),ЭтотОбъект.Дата, ТекущаяДата());
		
		Запрос.УстановитьПараметр("Дата", ДатаРасчета);
		Запрос.УстановитьПараметр("НачалоОборотов", НачалоДня(ЭтотОбъект.Основание.ДатаОпределенияСпискаЛиц));
		Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(ДатаРасчета, ВидГраницы.Исключая));
		
		Если ТаблицаДохода <> Неопределено И ТаблицаДохода.Количество() > 0 Тогда
			
			Запрос.УстановитьПараметр("ТаблицаДохода", ТаблицаДохода);
			Запрос.УстановитьПараметр("УчестьНалогообложенныйДоходПоОснованию", Ложь);
			
		Иначе
			
			ТаблицаДоходаДляЗапроса = ЭтотОбъект.РаспределениеДохода.Выгрузить();
			ТаблицаДоходаДляЗапроса.Колонки.Добавить("СтавкаНДФЛ", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДФЛ"));
			
			Запрос.УстановитьПараметр("ТаблицаДохода", ТаблицаДоходаДляЗапроса);
			Запрос.УстановитьПараметр("УчестьНалогообложенныйДоходПоОснованию", Истина);
			
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПолучательДохода) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.СуммаДохода = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТаблицаДохода <> Неопределено Тогда
				СтрокаНалога = ТаблицаДохода.Найти(ВыборкаДетальныеЗаписи.ПолучательДохода, "ПолучательДохода");
				Если СтрокаНалога = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось найти получателя дохода " 
					+ ВыборкаДетальныеЗаписи.ПолучательДохода + " в исходной таблице",,,, Отказ);
					Продолжить;
				КонецЕсли;
			Иначе
				СтрокаНалога = ЭтотОбъект.НачислениеНДФЛ.Добавить();
				СтрокаНалога.ПолучательДохода = ВыборкаДетальныеЗаписи.ПолучательДохода;
				СтрокаНалога.СтавкаНДФЛ = ВыборкаДетальныеЗаписи.СтавкаНДФЛ;
				СтрокаНалога.СуммаДохода = ВыборкаДетальныеЗаписи.СуммаДохода;
			КонецЕсли;
			
			СуммаДоходаВсего = ВыборкаДетальныеЗаписи.СуммаДоходаЗаГод + ВыборкаДетальныеЗаписи.СуммаДохода;
			СуммаНалогаВсего = Окр(СуммаДоходаВсего * РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДФЛ(СтрокаНалога.СтавкаНДФЛ) / 100, 0);
			
			СтрокаНалога.СуммаНДФЛ = СуммаНалогаВсего - ВыборкаДетальныеЗаписи.СуммаНДФЛЗаГод;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
